In [5]:
import pandas as pd
import numpy as np

In [6]:
dates = pd.date_range('1/1/2017', periods=8)

In [57]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [58]:
df

          A         B         C         D
0 -0.282986  0.435088  2.344834  0.207581
1  1.132077 -0.060766 -0.402681 -0.223074
2 -0.506983 -0.069478  1.067334  0.654060
3 -1.478656  0.147471 -1.616155  0.179368
4  0.857805 -0.577512  2.768951 -0.729923
5 -0.135486  1.324611 -0.176799  0.597296
6 -2.130089  0.021361  0.097609 -0.020158
7  0.028031 -0.989859 -0.152060  0.194412

In [62]:
df.sample(n=2)

          A         B         C         D
3 -1.478656  0.147471 -1.616155  0.179368
5 -0.135486  1.324611 -0.176799  0.597296

In [63]:
df

          A         B         C         D
0 -0.282986  0.435088  2.344834  0.207581
1  1.132077 -0.060766 -0.402681 -0.223074
2 -0.506983 -0.069478  1.067334  0.654060
3 -1.478656  0.147471 -1.616155  0.179368
4  0.857805 -0.577512  2.768951 -0.729923
5 -0.135486  1.324611 -0.176799  0.597296
6 -2.130089  0.021361  0.097609 -0.020158
7  0.028031 -0.989859 -0.152060  0.194412

In [89]:
df = pd.DataFrame({'AAA' : [1,2,1,3], 'BBB' : [1,1,2,2], 'CCC' : [2,1,3,1]}); df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [90]:
source_cols = df.columns

In [91]:
new_cols = [str(x) + "_cat" for x in source_cols]

In [92]:
new_cols

['AAA_cat', 'BBB_cat', 'CCC_cat']

In [93]:
categories = {1 : 'Alpha', 2 : 'Beta', 3 : 'Charlie' }

In [94]:
categories

{1: 'Alpha', 2: 'Beta', 3: 'Charlie'}

In [96]:
df[new_cols] = df[source_cols].applymap(categories.get);df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

In [100]:
categories.get()

TypeError: get expected at least 1 arguments, got 0